//Задача 64: Задайте значение N. Напишите программу, которая выведет все натуральные числа в промежутке от N до 1. Выполнить с помощью рекурсии.
// Console.WriteLine("Введите N");
// int N = Convert.ToInt32(Console.ReadLine());
// string RowRecursion(int N)
// {
//     if (N == 1) return $"{N} ";
//     else return $"{N} " + RowRecursion(N - 1);
// }
// Console.WriteLine(RowRecursion(N));