//Задача 66: Задайте значения M и N. Напишите программу, которая найдёт сумму натуральных элементов в промежутке от M до N.
// Console.WriteLine("Введите M");
// int M = Convert.ToInt32(Console.ReadLine());
// Console.WriteLine("Введите N");
// int N = Convert.ToInt32(Console.ReadLine());
// int sum = 0;
// void numSum (int M, int N, int sum)
// {
//     if (M > N) 
//     {
//         Console.WriteLine($"Сумма от M до N: {sum}"); 
//         return;
//     }
//     sum = sum + (M++);
//     numSum(M, N, sum);
// }

// numSum(M, N, 0);